; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_1 ?v4 - type_2 ?v2 - type_1)
 	      (pred_3 ?v7 - object ?v2 - type_1)
	      (pred_4 ?v4 - type_2 ?v8 - type_3)
	      (pred_2 ?v4 - type_2 ?v7 - object ?v8 - type_3))

   (:action op_3
       :parameters  (?v4 - type_2 ?v5 ?v6 - type_1)
       :precondition (and  (pred_1 ?v4 ?v5))
       :effect (and  (pred_1 ?v4 ?v6)
		     (not (pred_1 ?v4 ?v5))))

   (:action op_1
       :parameters (?v4 - type_2 ?v3 - object ?v1 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_3 ?v3 ?v1) (pred_1 ?v4 ?v1) (pred_4 ?v4 ?v8))
       :effect (and (pred_2 ?v4 ?v3 ?v8)
		    (not (pred_3 ?v3 ?v1)) 
		    (not (pred_4 ?v4 ?v8))))

   (:action op_2
       :parameters (?v4 - type_2 ?v3 - object ?v1 - type_1 ?v8 - type_3)
       :precondition  (and  (pred_2 ?v4 ?v3 ?v8) (pred_1 ?v4 ?v1))
       :effect (and (pred_3 ?v3 ?v1)
		    (pred_4 ?v4 ?v8)
		    (not (pred_2 ?v4 ?v3 ?v8)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_09 obj_06 - type_2
obj_10 obj_12 obj_04 obj_11 - type_3
obj_03 obj_02 obj_01 - type_1
obj_07 obj_05 obj_08 - object)
(:init
(pred_1 obj_09 obj_03)
(pred_4 obj_09 obj_10)
(pred_4 obj_09 obj_12)
(pred_1 obj_06 obj_01)
(pred_4 obj_06 obj_04)
(pred_4 obj_06 obj_11)
(pred_3 obj_07 obj_02)
(pred_3 obj_05 obj_02)
(pred_3 obj_08 obj_02)
)
(:goal
(and
(pred_3 obj_07 obj_01)
(pred_3 obj_05 obj_01)
(pred_3 obj_08 obj_03)
)
)

(:constraints
  (always (not (pred_1 obj_09 obj_01)))
)
)

; plan
1. (op_3 obj_09 obj_03 obj_02)
   deleted: (pred_1 obj_09 obj_03)
   added: (pred_1 obj_09 obj_02)
   goals met: 0 of 3
2. (op_3 obj_06 obj_01 obj_02)
   deleted: (pred_1 obj_06 obj_01)
   added: (pred_1 obj_06 obj_02)
   goals met: 0 of 3
3. (op_1 obj_09 obj_08 obj_02 obj_12)
   deleted: (pred_3 obj_08 obj_02) (pred_4 obj_09 obj_12)
   added: (pred_2 obj_09 obj_08 obj_12)
   goals met: 0 of 3
4. (op_1 obj_06 obj_05 obj_02 obj_11)
   deleted: (pred_3 obj_05 obj_02) (pred_4 obj_06 obj_11)
   added: (pred_2 obj_06 obj_05 obj_11)
   goals met: 0 of 3
5. (op_1 obj_06 obj_07 obj_02 obj_04)
   deleted: (pred_3 obj_07 obj_02) (pred_4 obj_06 obj_04)
   added: (pred_2 obj_06 obj_07 obj_04)
   goals met: 0 of 3
6. (op_3 obj_09 obj_02 obj_03)
   deleted: (pred_1 obj_09 obj_02)
   added: (pred_1 obj_09 obj_03)
   goals met: 0 of 3
7. (op_3 obj_06 obj_02 obj_01)
   deleted: (pred_1 obj_06 obj_02)
   added: (pred_1 obj_06 obj_01)
   goals met: 0 of 3
8. (op_2 obj_06 obj_05 obj_01 obj_11)
   deleted: (pred_2 obj_06 obj_05 obj_11)
   added: (pred_3 obj_05 obj_01) (pred_4 obj_06 obj_11)
   goals met: 1 of 3
9. (op_2 obj_06 obj_07 obj_01 obj_04)
   deleted: (pred_2 obj_06 obj_07 obj_04)
   added: (pred_3 obj_07 obj_01) (pred_4 obj_06 obj_04)
   goals met: 2 of 3
10. (op_2 obj_09 obj_08 obj_03 obj_12)
   deleted: (pred_2 obj_09 obj_08 obj_12)
   added: (pred_3 obj_08 obj_03) (pred_4 obj_09 obj_12)
   goals met: 3 of 3
